src/logs/result_artillery_info.txt
Phase started: unnamed (index: 0, duration: 1s) 15:25:41(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 15:25:42(-0300)

--------------------------------------
Metrics for period to: 15:25:50(-0300) (width: 1.601s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 629/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 298
  median: ...................................................................... 26.8
  p95: ......................................................................... 40
  p99: ......................................................................... 190.6
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 258.3
  max: ......................................................................... 754.4
  median: ...................................................................... 671.9
  p95: ......................................................................... 757.6
  p99: ......................................................................... 757.6


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 15:25:45(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 629/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 298
  median: ...................................................................... 26.8
  p95: ......................................................................... 40
  p99: ......................................................................... 190.6
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 258.3
  max: ......................................................................... 754.4
  median: ...................................................................... 671.9
  p95: ......................................................................... 757.6
  p99: ......................................................................... 757.6